{
    "planets": {
        "Mercury": {
            "size": "Equatorial Radius: 1,516 mi (2,440 km) radius; about 1/3 the size of Earth.",
            "distance": "Average distance from Sun ~57.9 million km (36 million mi) or 0.4 AU.",
            "formation": "Formed about 4.5 billion years ago when gravity pulled swirling gas and dust together.",
            "structure": "The second densest planet after Earth. It has a large metallic core, about 85% of its radius, that is partly molten or liquid. It has a thin outer shell (mantle and crust) and possesses a thin 'exosphere' instead of an atmosphere.",
            "surface": "Resembles Earth's Moon, scarred by many impact craters. Features are named after famous deceased artists, musicians, or authors. Surface temperatures are extreme, ranging from -180°C (-290°F) to 430°C (800°F)."
        },
        "Venus": {
            "size": "Equatorial Radius: 3,760 mi (6,052 km) radius; only slightly smaller than Earth.",
            "distance": "Average distance from Sun ~108.2 million km (67.24 million mi) or 0.72 AU.",
            "formation": "Formed about 4.5 billion years ago; similar size to Earth.",
            "structure": "A terrestrial planet with an iron core (approximately 3,000 km in radius) and a silicate mantle and crust. It has no global magnetic field. It is enveloped by a thick atmosphere, composed mostly of the greenhouse gas carbon dioxide, and clouds of sulfuric acid.",
            "surface": "The hottest planet in the solar system with surface temperatures reaching 470°C (880°F). Its surface features include volcanoes and mountains, and it is thought to have been completely resurfaced by volcanic activity 300 to 500 million years ago."
        },
        "Earth": {
            "size": "Equatorial Radius: 3,959 mi (6,371 km) radius.",
            "distance": "Average distance from Sun ~150 million km (93 million mi), defined as 1 AU.",
            "formation": "Formed about 4.5 billion years ago when gravity pulled swirling gas and dust together.",
            "structure": "Composed of four main layers: a solid inner core of iron and nickel, a liquid outer core, a silicate mantle, and a crust. Its lithosphere is divided into huge plates that are constantly moving (plate tectonics).",
            "surface": "A rocky, terrestrial planet with a solid and active surface of mountains, valleys, and plains. It is an ocean planet, with water covering 70% of its surface, supporting life within a nitrogen-oxygen atmosphere."
        },
        "Mars": {
            "size": "Equatorial Radius: 2,106 mi (3,390 km) radius; about half the size of Earth.",
            "distance": "Average distance from Sun ~228 million km (142 million mi) or 1.5 AU.",
            "formation": "Formed about 4.5 billion years ago from swirling gas and dust.",
            "structure": "A terrestrial planet with a dense core of iron, nickel, and sulfur, a rocky mantle, and a crust. Its atmosphere is very thin and contains more than 95% carbon dioxide.",
            "surface": "A dusty, cold, desert world, often called the Red Planet due to the oxidization (rusting) of iron minerals in its dirt. It has seasons, polar ice caps, canyons (like Valles Marineris), and the largest volcano in the solar system (Olympus Mons)."
        },
        "Jupiter": {
            "size": "Equatorial Radius: 43,441 mi (69,911 km) radius; about 11x Earth's radius.",
            "distance": "Average distance from Sun ~778 million km (484 million mi) or 5.2 AU.",
            "formation": "The oldest planet, forming about 4.6 billion years ago by rapid accumulation of gas around a massive core.",
            "structure": "A gas giant made mostly of hydrogen and helium. Deep inside, pressure compresses the hydrogen gas into a vast ocean of liquid metallic hydrogen. The central core is massive and may be 'dilute' or partially dissolved.",
            "surface": "No true solid surface; it is mostly swirling gases and liquids. Its appearance is dominated by colorful cloud bands and cyclonic storms, including the Great Red Spot, a giant storm raging for centuries."
        },
        "Saturn": {
            "size": "Equatorial Radius: 36,184 mi (58,232 km) radius; about 9x Earth's radius.",
            "distance": "Average distance from Sun ~1.43 billion km (886 million mi) or 9.5 AU.",
            "formation": "A gas giant formed by gas accretion around a solid core about 4.6 billion years ago. Its prominent ring system is formed from icy debris.",
            "structure": "Made mostly of hydrogen and helium. It has a dense core of metals like iron and nickel, enveloped by liquid metallic hydrogen and liquid hydrogen.",
            "surface": "No true solid surface. It is known for its spectacular ring system, made of billions of small chunks of ice and rock. Its atmosphere features a massive, six-sided jet stream (the hexagon) at its north pole."
        },
        "Uranus": {
            "size": "Equatorial Radius: 15,759 mi (25,362 km) radius; about 4x Earth's radius.",
            "distance": "Average distance from Sun ~2.9 billion km (1.8 billion mi) or 19 AU.",
            "formation": "An ice giant that formed from heavier volatiles and ices in the outer solar system about 4.5 billion years ago.",
            "structure": "An ice giant composed of a hot, dense fluid of 'icy' materials (water, methane, and ammonia) above a small rocky core. Methane gas in the atmosphere gives it a blue-green color.",
            "surface": "No true solid surface; it is mostly swirling fluids. Its unique axial tilt of 97.77 degrees causes it to spin sideways, resulting in extreme seasonal variations. It is surrounded by two sets of faint rings."
        },
        "Neptune": {
            "size": "Equatorial Radius: 15,299 mi (24,622 km) radius; only slightly smaller than Uranus.",
            "distance": "Average distance from Sun ~4.5 billion km (2.8 billion mi) or 30 AU.",
            "formation": "An ice giant that formed in the outer solar system from icy/rocky materials about 4.5 billion years ago, potentially closer to the Sun before moving outward.",
            "structure": "The densest of the giant planets. It has an icy mantle and rocky core with a hydrogen-helium and methane-rich atmosphere. Methane causes its vivid brighter blue color.",
            "surface": "No solid surface. It has active weather with strong winds and massive storms, such as the Great Dark Spot observed by Voyager 2. It has at least five main rings and four prominent ring arcs."
        },
        "Pluto": {
            "size": "Dwarf planet; equatorial diameter ~ 738 mi (1,187 km) radius; About 1/5th the width of Earth.",
            "distance": "Average distance from Sun ~5.9 billion km (3.7 billion mi) or 39 AU. Its orbit is eccentric and inclined.",
            "formation": "Formed in the Kuiper Belt from icy and rocky planetesimals about 4.5 billion years ago.",
            "structure": "An icy mantle over a rock-rich core; scientists believe it may have a subsurface ocean. It has a very tenuous atmosphere composed mostly of nitrogen, methane, and carbon monoxide.",
            "surface": "A complex world with varied terrain, including water-ice mountains, plains of nitrogen/methane ice, glaciers, and craters. Its surface is among the most contrasting in the solar system."
        }
    }
}